with v5.1.0

`module "dns" {
  source      = "terraform-google-modules/cloud-dns/google"
  version     = "v5.1.0"
  project_id  = "xxx"
  type        = "private"
  name        = "dbs.local"
  domain      = "dbs.local."
  description = "dbs records"

  private_visibility_config_networks = [
  "https://www.googleapis.com/compute/v1/projects/xxx/global/networks/vpc-test-yyy" 
    
  ]

  recordsets = [
    {
      name    = "dbs"
      type    = "A"
      ttl     = 300
      records = ["172.16.10.10"]
    },
  ]
}

`
$terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dns.google_dns_managed_zone.private[0] will be created
  + resource "google_dns_managed_zone" "private" {
      + creation_time   = (known after apply)
      + description     = "dbs records"
      + dns_name        = "dbs.local."
      + force_destroy   = false
      + id              = (known after apply)
      + managed_zone_id = (known after apply)
      + name            = "dbs.local"
      + name_servers    = (known after apply)
      + project         = "xxx"
      + visibility      = "private"

      + cloud_logging_config {
          + enable_logging = (known after apply)
        }

      + private_visibility_config {

          + networks {
              + network_url = "https://www.googleapis.com/compute/v1/projects/xxx/global/networks/vpc-test-yyy"
            }
        }
    }

  # module.dns.google_dns_record_set.cloud-static-records["dbs/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = dbs.local"
      + name         = "dbs.dbs.local."
      + project      = "xxx"
      + rrdatas      = [
          + "172.16.10.10",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


--------------
with v5.2.0

`module "dns" {
  source      = "terraform-google-modules/cloud-dns/google"
  version     = "v5.2.0"
  project_id  = "xxx"
  type        = "private"
  name        = "dbs.local"
  domain      = "dbs.local."
  description = "dbs records"

  private_visibility_config_networks = [
  "https://www.googleapis.com/compute/v1/projects/xxx/global/networks/vpc-test-yyy" 
    
  ]

  recordsets = [
    {
      name    = "dbs"
      type    = "A"
      ttl     = 300
      records = ["172.16.10.10"]
    },
  ]
}

$terrafrom plan
╷
│ Error: Invalid combination of arguments
│ 
│   with module.dns.google_dns_record_set.cloud-static-records["dbs/A"],
│   on .terraform/modules/dns/main.tf line 194, in resource "google_dns_record_set" "cloud-static-records":
│  194: resource "google_dns_record_set" "cloud-static-records" {
│ 
│ "routing_policy": only one of `routing_policy,rrdatas` can be specified, but `routing_policy,rrdatas` were specified.
╵
╷
│ Error: Invalid combination of arguments
│ 
│   with module.dns.google_dns_record_set.cloud-static-records["dbs/A"],
│   on .terraform/modules/dns/main.tf line 207, in resource "google_dns_record_set" "cloud-static-records":
│  207:   rrdatas = each.value.records
│ 
│ "rrdatas": only one of `routing_policy,rrdatas` can be specified, but `routing_policy,rrdatas` were specified.`
